module Decoder_3_8(
    
    // 端口列表
    a , 
    b , 
    c , 
    out 
    );
    
    // 功能列表
    input a;
    input b;
    input c;
    output [7:0]out ;   // *定义位宽
    
    reg [7:0]out ;
    
    // 逻辑描述
    // *以always块描述的信号赋值,被赋值的对象必须定义为reg类型
    always@(*)  // *选择引脚 (*代表全部)
        case({a , b , c})   // *{a , b , c}变成了一个三位的信号(位拼接)
            3'b000 : out = 8'b0000_0001 ;
            3'b001 : out = 8'b0000_0010 ;
            3'b010 : out = 8'b0000_0100 ;
            3'b011 : out = 8'b0000_1000 ;
            3'b100 : out = 8'b0001_0000 ;
            3'b101 : out = 8'b0010_0000 ;
            3'b110 : out = 8'b0100_0000 ;
            3'b111 : out = 8'b1000_0000 ;
        endcase 
endmodule

// 1. 位拼接
// wire [3:0]d ;
// assign d = {a , 1'b0 , b , c}

// 2. bdoh , 注意点:位数 + ' + <进制> + 数据 , 数据之间位数需要一样,数据则根据进制来 , 3'd1 = 3'b001
// 3'b101 = 3'd5 , 8'b0000_1010 = 8'ha